# Pandas Module in Python

#### Don't forget to pip install pandas

In [32]:
# Import module
import pandas as pd
import numpy as np
import numpy.random

## Pandas Series

In [4]:
# Creating from index list and data list
labels = ["Semih","Yaren","Alperen","Nazlı","Burak","Rana"]
values = [10,20,30,40,50,60]
pd.Series(data = values, index = labels)

Semih      10
Yaren      20
Alperen    30
Nazlı      40
Burak      50
Rana       60
dtype: int64

In [5]:
# Creating from data list
# Indexes are default. Start from 0
pd.Series(data = values)

0    10
1    20
2    30
3    40
4    50
5    60
dtype: int64

In [10]:
# Creating from numpy array
arr = np.arange(10,60,10)
pd.Series(arr) # pd.Series(data = arr)

0    10
1    20
2    30
3    40
4    50
dtype: int32

In [20]:
# Creating from dictionary
dataDict = {"Semih" : 1, "Alperen" : 2, "Burak" : 3, "Musa" : 4, "Tugay" : 5}
pd.Series(dataDict)

Semih      1
Alperen    2
Burak      3
Musa       4
Tugay      5
dtype: int64

In [22]:
# Summation in Series
series1 = pd.Series({"Apple" : 5,"Orange" : 3, "Banana" : 7})
series2 = pd.Series({"Lemon" : 4, "Apple" : 6, "Banana" : 3})
series1 + series2
# The values which have common index are added.
# Rest of the values are assigned as NaN (Not a Number)

Apple     11.0
Banana    10.0
Lemon      NaN
Orange     NaN
dtype: float64

In [24]:
series1

Apple     5
Orange    3
Banana    7
dtype: int64

In [30]:
# Reaching the values
print(series1[0])
print(series1['Apple'])
# print(series1['Lemon']) This line raises a key error

5
5

## Dataframe

In [97]:
# Creating dataframe
# pd.DataFrame(data, index, column)
df = pd.DataFrame(data = np.random.randn(3,3), index = ["A","B","C"], 
                            columns = ["Column1", "Column2","Column3"])
df

    Column1   Column2   Column3
A -0.210046  0.113181  1.556996
B  0.844872  0.024920  1.893675
C  0.538401 -0.930486  0.367389

#### Actually, every column is a pandas series

In [98]:
print(type(df["Column1"]))
df["Column1"]

<class 'pandas.core.series.Series'>

A   -0.210046
B    0.844872
C    0.538401
Name: Column1, dtype: float64

In [99]:
# Reaching the values
df.loc["A"] # df.loc[index]. loc becomes from location

Column1   -0.210046
Column2    0.113181
Column3    1.556996
Name: A, dtype: float64

In [100]:
df.iloc[0] # df.iloc[rowIndex]

Column1   -0.210046
Column2    0.113181
Column3    1.556996
Name: A, dtype: float64

In [101]:
# Reaching a spesific value
df.loc["A","Column1"]

-0.21004601411838486

In [102]:
df[["Column1","Column2"]] # returns a dataframe

    Column1   Column2
A -0.210046  0.113181
B  0.844872  0.024920
C  0.538401 -0.930486

In [103]:
# Adding a column
# Indexes must be same
# number of data must be same
df["Column4"] = pd.Series(np.random.randn(3), ["A","B","C"])

In [104]:
df

    Column1   Column2   Column3   Column4
A -0.210046  0.113181  1.556996  0.463489
B  0.844872  0.024920  1.893675 -0.091419
C  0.538401 -0.930486  0.367389 -0.863937

In [105]:
df["Column5"] = df["Column2"] + df["Column3"]

In [106]:
df

    Column1   Column2   Column3   Column4   Column5
A -0.210046  0.113181  1.556996  0.463489  1.670177
B  0.844872  0.024920  1.893675 -0.091419  1.918595
C  0.538401 -0.930486  0.367389 -0.863937 -0.563098

In [107]:
# Deleting a row or column
# DataFrame.drop(labels, axis)
# axis is 0 as default
# axis = 0 for indexes
# axis = 1 for columns
df.drop("Column5", axis = 1, inplace = True)
# df = df.drop("Column2", axis = 1) # it is same
# inplace is False as default
# when it is false dataframe will not be updated

In [108]:
df

    Column1   Column2   Column3   Column4
A -0.210046  0.113181  1.556996  0.463489
B  0.844872  0.024920  1.893675 -0.091419
C  0.538401 -0.930486  0.367389 -0.863937

### Filtering

In [109]:
df > 0 # Values that greater than 0 return True, others return False

   Column1  Column2  Column3  Column4
A    False     True     True     True
B     True     True     True    False
C     True    False     True    False

In [110]:
df[df > 0] # Values that greater than 0 don't change, others become NaN

    Column1   Column2   Column3   Column4
A       NaN  0.113181  1.556996  0.463489
B  0.844872  0.024920  1.893675       NaN
C  0.538401       NaN  0.367389       NaN

In [111]:
df["Column1"] < -1 # filtering a column

A    False
B    False
C    False
Name: Column1, dtype: bool

In [112]:
df[df["Column1"] < -1]
# A is True, others are False
# that returns rows that are True

Empty DataFrame
Columns: [Column1, Column2, Column3, Column4]
Index: []

In [113]:
df["Column6"] = [1,2,3] # added a column
df

    Column1   Column2   Column3   Column4  Column6
A -0.210046  0.113181  1.556996  0.463489        1
B  0.844872  0.024920  1.893675 -0.091419        2
C  0.538401 -0.930486  0.367389 -0.863937        3

In [114]:
df.set_index("Column6", inplace = True)
# set a spesific column as index

In [115]:
df

          Column1   Column2   Column3   Column4
Column6
1       -0.210046  0.113181  1.556996  0.463489
2        0.844872  0.024920  1.893675 -0.091419
3        0.538401 -0.930486  0.367389 -0.863937

In [122]:
# Multi index in dataframes
out = ["G1","G1","G1","G2","G2","G2","G3","G3","G3"]
inner = ["Index1","Index2","Index3","Index1","Index2","Index3","Index1","Index2","Index3"]
# defining outer indexes and inner indexes

In [123]:
list(zip(out,inner)) # zipping indexes

[('G1', 'Index1'),
 ('G1', 'Index2'),
 ('G1', 'Index3'),
 ('G2', 'Index1'),
 ('G2', 'Index2'),
 ('G2', 'Index3'),
 ('G3', 'Index1'),
 ('G3', 'Index2'),
 ('G3', 'Index3')]

In [124]:
# converting the list to indexes using pd.MultiIndex
multiIndex = list(zip(out,inner))
multiIndex = pd.MultiIndex.from_tuples(multiIndex)
multiIndex

MultiIndex([('G1', 'Index1'),
            ('G1', 'Index2'),
            ('G1', 'Index3'),
            ('G2', 'Index1'),
            ('G2', 'Index2'),
            ('G2', 'Index3'),
            ('G3', 'Index1'),
            ('G3', 'Index2'),
            ('G3', 'Index3')],
           )

In [129]:
df = pd.DataFrame(np.random.randn(9,3),multiIndex,columns = ["A","B","C"])

In [130]:
df

                  A         B         C
G1 Index1 -0.620012  0.577952 -1.691893
   Index2  0.406492  0.587586 -0.796862
   Index3 -1.279604 -0.068127 -0.610115
G2 Index1 -1.417471  1.243001 -0.541840
   Index2  0.670639  0.292023  1.296732
   Index3 -0.364709  0.115863  0.959981
G3 Index1 -0.682408  1.988140  1.398660
   Index2 -0.871624  0.527367 -0.589786
   Index3  0.624040 -0.164189  0.729057

In [131]:
df["A"]

G1  Index1   -0.620012
    Index2    0.406492
    Index3   -1.279604
G2  Index1   -1.417471
    Index2    0.670639
    Index3   -0.364709
G3  Index1   -0.682408
    Index2   -0.871624
    Index3    0.624040
Name: A, dtype: float64

In [134]:
df.loc["G2"]

               A         B         C
Index1 -1.417471  1.243001 -0.541840
Index2  0.670639  0.292023  1.296732
Index3 -0.364709  0.115863  0.959981

In [137]:
# To reach more than one column or group or index
# They should be written as list
df.loc[["G1","G3"]]

                  A         B         C
G1 Index1 -0.620012  0.577952 -1.691893
   Index2  0.406492  0.587586 -0.796862
   Index3 -1.279604 -0.068127 -0.610115
G3 Index1 -0.682408  1.988140  1.398660
   Index2 -0.871624  0.527367 -0.589786
   Index3  0.624040 -0.164189  0.729057

In [139]:
df.loc["G1"].loc["Index1"]
# It returns series

A   -0.620012
B    0.577952
C   -1.691893
Name: Index1, dtype: float64

In [140]:
df.loc["G1"].loc["Index1"]["B"]

0.5779516568184554

In [142]:
# Giving name to indexes
df.index.names = ["Groups","Indexes"]
df

                       A         B         C
Groups Indexes
G1     Index1  -0.620012  0.577952 -1.691893
       Index2   0.406492  0.587586 -0.796862
       Index3  -1.279604 -0.068127 -0.610115
G2     Index1  -1.417471  1.243001 -0.541840
       Index2   0.670639  0.292023  1.296732
       Index3  -0.364709  0.115863  0.959981
G3     Index1  -0.682408  1.988140  1.398660
       Index2  -0.871624  0.527367 -0.589786
       Index3   0.624040 -0.164189  0.729057

### Missing Data

In [144]:
arr = np.array([[10,20,np.nan],[5,np.nan,np.nan],[21,np.nan,10]])
arr
# Creating a data with missing values

array([[10., 20., nan],
       [ 5., nan, nan],
       [21., nan, 10.]])

In [153]:
df = pd.DataFrame(arr,index = ["Index1","Index2","Index3"], columns = ["A","B","C"])
df

           A     B     C
Index1  10.0  20.0   NaN
Index2   5.0   NaN   NaN
Index3  21.0   NaN  10.0

In [154]:
# Deleting the columns or rows that have at least one NaN
df.dropna(axis = 1, inplace = False)

           A
Index1  10.0
Index2   5.0
Index3  21.0

In [155]:
df.dropna(axis = 0, inplace = False)

Empty DataFrame
Columns: [A, B, C]
Index: []

In [159]:
# It removes the row or column if there are more than 2 (thresh) value which is not NaN 
df.dropna(thresh = 2, inplace = False)

           A     B     C
Index1  10.0  20.0   NaN
Index3  21.0   NaN  10.0

In [160]:
df.dropna(thresh = 3, inplace = False)

Empty DataFrame
Columns: [A, B, C]
Index: []

In [161]:
df.fillna(value = 1)
# Filling the NaN values

           A     B     C
Index1  10.0  20.0   1.0
Index2   5.0   1.0   1.0
Index3  21.0   1.0  10.0

In [162]:
df.fillna(value = 2)
# Filling the NaN values

           A     B     C
Index1  10.0  20.0   2.0
Index2   5.0   2.0   2.0
Index3  21.0   2.0  10.0

In [163]:
# To fill values with the mean of other values
# Sum of values
df.sum()

A    36.0
B    20.0
C    10.0
dtype: float64

In [164]:
df.sum().sum()

66.0

In [166]:
df.size # size of dataframe

9

In [168]:
df.isnull() # if the value is NaN return True

            A      B      C
Index1  False  False   True
Index2  False   True   True
Index3  False   True  False

In [173]:
print(df.isnull().sum())
df.isnull().sum().sum()
# Finding the number of NaNs

A    0
B    2
C    2
dtype: int64

4

In [175]:
df.size - df.isnull().sum().sum()
# Finding the number of the values which are not NaN

5

In [181]:
# Calculating the mean
total = df.sum().sum()
num = df.size - df.isnull().sum().sum()
print(total)
mean = total / num
mean

66.0

13.2

In [186]:
df.fillna(value = mean, inplace=True)
# Filling the NaN values with the mean
df

           A     B     C
Index1  10.0  20.0  13.2
Index2   5.0  13.2  13.2
Index3  21.0  13.2  10.0

### Groupby

In [187]:
data = {
    "Department" : ["Informatic","Human Resources","Manufacture","Manufacture","Informatic","Human Resources"],
    "Salary" : [3000,3500,2500,4500,4000,2000],
    "Employee" : ["Semih","Alperen","Burak","Tugay","Musa","Batuhan"]
    }
df = pd.DataFrame(data)

In [188]:
df

        Department  Salary Employee
0       Informatic    3000    Semih
1  Human Resources    3500  Alperen
2      Manufacture    2500    Burak
3      Manufacture    4500    Tugay
4       Informatic    4000     Musa
5  Human Resources    2000  Batuhan

In [192]:
# Gorupby gets together the same values in given row or column
# Groupby(labels,axis = 0)
depGroup = df.groupby("Department")
depGroup

In [193]:
# Salaries were added which have same department  
depGroup.sum()

                 Salary
Department
Human Resources    5500
Informatic         7000
Manufacture        7000

In [194]:
# Sum of salaries that belong to employees which work in informatic
df.groupby("Department").sum().loc["Informatic"]

Salary    7000
Name: Informatic, dtype: int64

In [195]:
df.groupby("Department").count()
# count departments

                 Salary  Employee
Department
Human Resources       2         2
Informatic            2         2
Manufacture           2         2

In [196]:
df.groupby("Department").max()
# Finds max values for every group
# df.groupby("Department").min() finds min

                 Salary Employee
Department
Human Resources    3500  Batuhan
Informatic         4000    Semih
Manufacture        4500    Tugay

In [198]:
# It may be used like this
df.groupby("Department").min()["Salary"]["Informatic"]

3000

In [200]:
df.groupby("Department").mean()
# Finds the mean value for every group

                 Salary
Department
Human Resources    2750
Informatic         3500
Manufacture        3500

### Merge, Join and Concatenate

In [210]:
data1 = {
    "A" : ["A1","A2","A3","A4"],
    "B" : ["B1","B2","B3","B4"],
    "C" : ["C1","C2","C3","C3"]
}
data2 = {
    "A" : ["A5","A6","A7","A8"],
    "B" : ["B5","B6","B7","B8"],
    "C" : ["C5","C6","C7","C8"]
}
df1 = pd.DataFrame(data1, index = [1,2,3,4])
df2 = pd.DataFrame(data2, index = [5,6,7,8])

In [211]:
df1

    A   B   C
1  A1  B1  C1
2  A2  B2  C2
3  A3  B3  C3
4  A4  B4  C3

In [212]:
df2

    A   B   C
5  A5  B5  C5
6  A6  B6  C6
7  A7  B7  C7
8  A8  B8  C8

In [213]:
# Concatenation of two dataframes
pd.concat([df1,df2], axis = 0)

    A   B   C
1  A1  B1  C1
2  A2  B2  C2
3  A3  B3  C3
4  A4  B4  C3
5  A5  B5  C5
6  A6  B6  C6
7  A7  B7  C7
8  A8  B8  C8

In [214]:
pd.concat([df1,df2], axis = 1)
# It assigns NaN to missing values

     A    B    C    A    B    C
1   A1   B1   C1  NaN  NaN  NaN
2   A2   B2   C2  NaN  NaN  NaN
3   A3   B3   C3  NaN  NaN  NaN
4   A4   B4   C3  NaN  NaN  NaN
5  NaN  NaN  NaN   A5   B5   C5
6  NaN  NaN  NaN   A6   B6   C6
7  NaN  NaN  NaN   A7   B7   C7
8  NaN  NaN  NaN   A8   B8   C8

In [215]:
data1 = {
    "A" : ["A1","A2","A3","A4"],
    "B" : ["B1","B2","B3","B4"]
}
data2 = {
    "X" : ["X1","X2","X3"],
    "Y" : ["Y1","Y2","Y3"]
}
df1 = pd.DataFrame(data1, index = [1,2,3,4])
df2 = pd.DataFrame(data2, index = [1,2,3])

In [216]:
df1

    A   B
1  A1  B1
2  A2  B2
3  A3  B3
4  A4  B4

In [217]:
df2

    X   Y
1  X1  Y1
2  X2  Y2
3  X3  Y3

In [218]:
# Joining
# df.join(other, how = 'left')
# it is left join as default
# You can change it 
# left, right, inner, outer
df1.join(df2)
# values that df1 has but df2 doesn't have will be NaN

    A   B    X    Y
1  A1  B1   X1   Y1
2  A2  B2   X2   Y2
3  A3  B3   X3   Y3
4  A4  B4  NaN  NaN

In [219]:
df2.join(df1)
# There is no value that df2 has but df1 doesn't have

    X   Y   A   B
1  X1  Y1  A1  B1
2  X2  Y2  A2  B2
3  X3  Y3  A3  B3

In [227]:
data1 = {
    "A" : ["A1","A2","A3"],
    "B" : ["B1","B2","B3"],
    "Key" : ["K1","K2","K3"]
}
data2 = {
    "X" : ["X1","X2","X3","X4"],
    "Y" : ["Y1","Y2","Y3","Y4"],
    "Key" : ["K1","K2","K4","K5"]
}
df1 = pd.DataFrame(data1, index = [1,2,3])
df2 = pd.DataFrame(data2, index = [1,2,3,4])

In [228]:
df1

    A   B Key
1  A1  B1  K1
2  A2  B2  K2
3  A3  B3  K3

In [229]:
df2

    X   Y Key
1  X1  Y1  K1
2  X2  Y2  K2
3  X3  Y3  K4
4  X4  Y4  K5

In [230]:
# Merging
# pd.merge(left, right, column, how = 'inner')
pd.merge(df1,df2, on = "Key")

    A   B Key   X   Y
0  A1  B1  K1  X1  Y1
1  A2  B2  K2  X2  Y2

### Operations

In [231]:
df = pd.DataFrame({
    "Column1" : [1,2,3,4,5,6],
    "Column2" : [100,100,200,300,300,100],
    "Column3" : ["Semih","Yaren","Alperen","Nazlı","Burak","Rana"]
})

In [232]:
df

   Column1  Column2  Column3
0        1      100    Semih
1        2      100    Yaren
2        3      200  Alperen
3        4      300    Nazlı
4        5      300    Burak
5        6      100     Rana

In [233]:
# df.head(n = 5)
# head method returns first n row
df.head()

   Column1  Column2  Column3
0        1      100    Semih
1        2      100    Yaren
2        3      200  Alperen
3        4      300    Nazlı
4        5      300    Burak

In [235]:
df.head(n = 3)

   Column1  Column2  Column3
0        1      100    Semih
1        2      100    Yaren
2        3      200  Alperen

In [236]:
# unique method returns the unique values as a np.array in given column
df["Column2"].unique()

array([100, 200, 300], dtype=int64)

In [238]:
# Number of unique values
df["Column2"].nunique()

3

In [240]:
# number of each value
df["Column2"].value_counts()

100    3
300    2
200    1
Name: Column2, dtype: int64

In [241]:
df

   Column1  Column2  Column3
0        1      100    Semih
1        2      100    Yaren
2        3      200  Alperen
3        4      300    Nazlı
4        5      300    Burak
5        6      100     Rana

In [242]:
def multiplyBy3(df):
    return df*3

In [243]:
# applies the function for each value in given column
df["Column2"].apply(multiplyBy3)

0    300
1    300
2    600
3    900
4    900
5    300
Name: Column2, dtype: int64

In [244]:
# Dropes given column
df.drop("Column3", axis = 1, inplace = False)

   Column1  Column2
0        1      100
1        2      100
2        3      200
3        4      300
4        5      300
5        6      100

In [246]:
# Returns columns
df.columns

Index(['Column1', 'Column2', 'Column3'], dtype='object')

In [248]:
# Sorting df according to given column
# df.sort_values(by, axis = 0, ascending = True)
df.sort_values("Column2")

   Column1  Column2  Column3
0        1      100    Semih
1        2      100    Yaren
5        6      100     Rana
2        3      200  Alperen
3        4      300    Nazlı
4        5      300    Burak

In [249]:
df.sort_values("Column2", ascending=False)

   Column1  Column2  Column3
3        4      300    Nazlı
4        5      300    Burak
2        3      200  Alperen
0        1      100    Semih
1        2      100    Yaren
5        6      100     Rana

In [ ]:
# Reading files
pd.read_csv(filename)
# read the csv file and convert it to a dataframe
# There are variety of read method
# pd.read_excel
# pd.read_html
# ...